---
kind: method
id: M:Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.FormatOptions)
source: html/405ece11-de8b-6664-9784-2e80b22c8e74.htm
---
# Autodesk.Revit.DB.FormatOptions.#ctor Method

Creates a copy of a FormatOptions object.

## Syntax (C#)
```csharp
public FormatOptions(
	FormatOptions other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.FormatOptions`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null